app/views/groups/index.html.erb

        <% @people.each do |gens|%>
        <% if group.id == gens.group_id %>
---
SELECT "groups".* FROM "groups"