app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "salle", "tache", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["salle", ""], ["tache", ""], ["created_at", "2016-02-15 23:28:43.121291"], ["updated_at", "2016-02-15 23:28:43.121291"]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "name" = $1, "salle" = $2, "tache" = $3, "updated_at" = $4 WHERE "groups"."id" = $5  [["name", "titi"], ["salle", "001"], ["tache", "créer site responsive"], ["updated_at", "2016-02-16 09:18:24.476808"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)

DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 2]]
---
  def destroy
    @group.destroy

SELECT "groups".* FROM "groups"
SELECT COUNT(*) FROM "groups"
---
  def Rand
    @people = Person.all

    @people.each do |person|
    person.sensei = false
    person.save
 end
   idperson = Person.all.map{|x| x.id}
   if Group.all.count>0